---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation.NotDefined
enum: Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation
source: html/90930859-e2e7-2204-aed0-d738af6c306d.htm
---
# Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation.NotDefined

The connection type is not defined for this connection.